
## Plan Result

[CI link](https://github.com/marwenbhriz/ga-terraform/actions/runs/9934103659)


<pre><code>Plan: 8 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.cloudsql.google_compute_global_address.private_ip_address
  * module.cloudsql.google_service_networking_connection.ga-private-vpc-connection
  * module.cloudsql.google_sql_database.database
  * module.cloudsql.google_sql_database_instance.default
  * module.cloudsql.google_sql_user.gauser
  * module.cloudsql.random_id.mysql_gauser_password
  * module.network.google_compute_network.ga-vpc
  * module.network.google_compute_subnetwork.ga-subnetwork


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cloudsql.google_compute_global_address.private_ip_address will be created
  + resource "google_compute_global_address" "private_ip_address" {
      + address            = "191.100.0.0"
      + address_type       = "INTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "ga-private-ip-address"
      + network            = (known after apply)
      + prefix_length      = 20
      + project            = "grasys-study"
      + purpose            = "VPC_PEERING"
      + self_link          = (known after apply)
    }

  # module.cloudsql.google_service_networking_connection.ga-private-vpc-connection will be created
  + resource "google_service_networking_connection" "ga-private-vpc-connection" {
      + id                      = (known after apply)
      + network                 = (known after apply)
      + peering                 = (known after apply)
      + reserved_peering_ranges = [
          + "ga-private-ip-address",
        ]
      + service                 = "servicenetworking.googleapis.com"
    }

  # module.cloudsql.google_sql_database.database will be created
  + resource "google_sql_database" "database" {
      + charset         = "utf8"
      + collation       = "utf8_general_ci"
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "ga-terraform"
      + name            = "books"
      + project         = "grasys-study"
      + self_link       = (known after apply)
    }

  # module.cloudsql.google_sql_database_instance.default will be created
  + resource "google_sql_database_instance" "default" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "MYSQL_8_0"
      + deletion_protection            = false
      + dns_name                       = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "ga-terraform"
      + private_ip_address             = (known after apply)
      + project                        = "grasys-study"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "asia-northeast1"
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + connector_enforcement = (known after apply)
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = (known after apply)
          + disk_type             = "PD_SSD"
          + edition               = "ENTERPRISE"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-f1-micro"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + backup_configuration {
              + binary_log_enabled             = true
              + enabled                        = true
              + location                       = "asia"
              + start_time                     = "00:00"
              + transaction_log_retention_days = 5

              + backup_retention_settings {
                  + retained_backups = 7
                  + retention_unit   = "COUNT"
                }
            }

          + ip_configuration {
              + enable_private_path_for_google_cloud_services = false
              + ipv4_enabled                                  = false
              + private_network                               = (known after apply)
              + require_ssl                                   = false
              + ssl_mode                                      = (known after apply)
            }

          + location_preference {
              + follow_gae_application = (known after apply)
              + secondary_zone         = (known after apply)
              + zone                   = (known after apply)
            }
        }
    }

  # module.cloudsql.google_sql_user.gauser will be created
  + resource "google_sql_user" "gauser" {
      + host                    = "%"
      + id                      = (known after apply)
      + instance                = "ga-terraform"
      + name                    = "gauser"
      + password                = (sensitive value)
      + project                 = "grasys-study"
      + sql_server_user_details = (known after apply)
    }

  # module.cloudsql.random_id.mysql_gauser_password will be created
  + resource "random_id" "mysql_gauser_password" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 12
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.network.google_compute_network.ga-vpc will be created
  + resource "google_compute_network" "ga-vpc" {
      + auto_create_subnetworks                   = false
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "ga-vpc"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + numeric_id                                = (known after apply)
      + project                                   = "grasys-study"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # module.network.google_compute_subnetwork.ga-subnetwork will be created
  + resource "google_compute_subnetwork" "ga-subnetwork" {
      + creation_timestamp         = (known after apply)
      + description                = "ga-subnet-1a"
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.0.1.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "ga-subnetwork"
      + network                    = (known after apply)
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = "grasys-study"
      + purpose                    = (known after apply)
      + region                     = "asia-northeast1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)

      + log_config {
          + aggregation_interval = "INTERVAL_5_SEC"
          + filter_expr          = "true"
          + flow_sampling        = 0.5
          + metadata             = "INCLUDE_ALL_METADATA"
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":15,"Program":"tfcmt","SHA1":"ea494043d2d9e8abab49f3082f674162bb9101fd","Vars":{},"WorkflowName":"terraform plan"} -->